Repository: SamaaHamayel/anemia-graduation-project
Catalog: lib/l10n/app_*.arb
Languages: ar

# onBoardingTitle0
source: Easily Detect Anemia!
ar: !معرفه انيميا فقر الدم بكل سهوله

# personalInfoKey
source: personalInfo
ar: المعلومات الشخصيه

# onBoardingSubTitle0
source: Welcome to our app! Use your eyelid to detect and identify the type of anemia with high accuracy. Start now and discover your health with just one click!
ar: مرحبًا بكم في تطبيقنا! استخدم جفنك لاكتشاف وتحديد نوع فقر الدم بدقة عالية. ابدأ الآن واكتشف صحتك بنقرة واحدة فقط!

# onBoardingTitle1
source: Identify Your Anemia Type!
ar: !معرفه نوع الانيميا لديك

# onBoardingSubTitle1
source: With our app, your knowledge of anemia won't be limited to detection only, but you'll also get an analysis of the type of anemia you're experiencing.
ar: مع تطبيقنا، لن تقتصر معرفتك بفقر الدم على الاكتشاف فقط، ولكنك ستحصل أيضًا على تحليل لنوع فقر الدم الذي تعاني منه.

# onBoardingTitle2
source: Get Accurate Medical Guidance!
ar: !احصل علي الدليل الطبي الدقيق

# onBoardingSubTitle2
source: Discover the best doctors and specialists in anemia and its types through our app. Let's embark on your health journey today!
ar: اكتشف أفضل الأطباء والمتخصصين في فقر الدم وأنواعه من خلال تطبيقنا. لنبدأ رحلتك الصحية اليوم!

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Sign in
ar: تسجيل الدخول

source: Settings
ar: الاعدادات

source: Email
ar: البريد الالكتروني

source: Phone
ar: رقم الهاتف

source: Code
ar: الرمز

source: Yes
ar: نعم

source: No
ar: لا

# country
source: Country Location
ar: الموقع الخاص بك

source: Dark Mode
ar: الوضع الليلي

source: Account
ar: الحساب

# language
source: Language ( Ar العربيه)
ar: !اللغه (EN English)

source: Notifications
ar: الاشعارات

source: Start
ar: ابدأ

source: Weight:
ar: الورن:

source: Height:
ar: الطول:

source: Enter your height
ar: من فضلك ادخل الطول

source: Enter your weight
ar: من فضلك ادخل الوزن

source: WriteHere
ar: اكتب هنا

source: Are you on your period?
ar: هل لديك الدوره الشهريه الان؟

source: Infants
ar: الرضع

source: Adult males
ar: الذكور البالغين

source: Adult females (pregnant)
ar: ايناث بالغين(حامل)

source: Adult females (not pregnant)
ar: ايناث بالغين(ليست حامل)

source: Young children
ar: اطفال ضغار

source: Choose your category:
ar: اختر فئتك:

source: Personal information
ar: المعلومات الشخصيه

# emailHint
source: Enter your Email
ar: ادخل البريد الكتروني الخاص بك

source: Enter Valid Email
ar: ادخل بريد الكتروني صحيح

source: Enter Valid Code
ar: ادخل الكود الصحيح

source: Password
ar: كلمه السر

# passwordHint
source: Enter your Password
ar: ادخل كلمه السر

source: Forget password ?
ar: نسيت كلمه السر؟

source: OR
ar: أو

# dontHaveAccount
source: Don’t have an account?
ar: ليس لديك حساب؟

source: Login Successfully
ar: تم تسجيل الدخول بنجاح

# checkEmail
source: Check Your Email..!
ar: !..تفقد بريدك الالكتروني

source: Sign up
ar: انشاء حساب

source: Name
ar: الاسم

# nameHint
source: Enter your Name
ar: ادخل اسمك

source: Confirm Password
ar: تاكيد كلمه السر

# confirmPasswordHint
source: Enter your Confirm Password
ar: ادخل تاكيد كلمه المرور الخاصه بك

source: Already have an account?
ar: بالفعل لديك حساب؟

source: Wrong Password
ar: كلمه مرور خاطيئه

source: Enter Valid Password
ar: ادخل كلمه مرور صحيحه

# enterValidPasswordEqualTo
source: Enter Same above Password
ar: ادخل نفس كلمه المرور بالاعلي

source: Enter your Phone
ar: ادخل رقم الهاتف الخاص بك

# forgetPasswordTitle
source: Enter your email Address or phone number to receive a verification card
ar: أدخل عنوان بريدك الإلكتروني أو رقم الهاتف لتلقي بطاقة التحقق

source: Send
ar: ارسال

source: Verify
ar: تثبيت كلمه المرور

# verifyTitle
source: Please enter the 4 digit code send to *****@mail.com
ar: الرجاء ادخال الرمز المكون من 4 ارقام تم ارساله الي****@gmail.com

source: Resent Code
ar: اعاده ارسال الرمز

source: Create new password
ar: انشاء كلمه مرور جديده

source: New Password
ar: كلمه سر جديده

source: Confirm New Password
ar: تاكيد كلمه السر الجديده

source: Save
ar: حفظ

source: Your password has been changed successfully !
ar: تم تغير كلمه المرور الخاصه بك بنجاح!

# homeScreenSubTitle
source: Start your journey towards better health now.
ar: ابدأ رحلتك نحو صحة أفضل الآن.

# homeScreenTitle
source: You can take or upload photo for your eyelid to know whether you have anemia or not
ar: يمكنك التقاط أو تحميل صورة لجفنك لمعرفة ما إذا كنت مصابًا بفقر الدم أم لا

source: Upload your File
ar: قم بتحميل ملفك

# uploadFileTitle
source: File should be JPG , PNG
ar: يجب أن يكون الملف JPG , PNG

source: Choose File
ar: اختار ملف

source: We can’t reach your eyelid
ar: لا يمكننا الوصول الي جفنك

source: Try Again
ar: حاول مره اخري

source: Do you suffer from any chronic illnesses?
ar: هل تعاني من أي أمراض مزمنة؟

source: What medications are you taking?
ar: ما الأدوية التي تتناولها؟

source: What chronic illness do you suffer from?
ar: ما هو المرض المزمن الذي تعاني منه؟

source: Are you vegetarian?
ar: هل انت نباتي؟

source: Do you take vitamin B12?
ar: هل تتناول فيتامين ب 12؟

source: Upload Complete
ar: اكتمل التحميل

source: Please wait....
ar: ...من قضلك انتظر

source: Recognize
ar: التعرف

source: You are: not anemic
ar: انت: لست مصاب بفقر الدم

source: You are: anemic
ar: انت: مصاب بفقر الدم

source: Detect Anemia:
ar: الكشف عن فقر الدم:

# detectAnemiaTitle
source: You can take or upload photo for your eyelid to know whether you have anemia or not'Make sure there is high lighting'
ar: 'تأكد من وجود إضاءة عالية'يمكنك التقاط أو تحميل صورة لجفنك لمعرفة ما إذا كنت مصابًا بفقر الدم أم لا

source: Test Results:
ar: نتائج الاختبار:

# testResultsTitle
source: Please get a CBC test done at a laboratory, then input the results to determine the type of anemia you have.
ar: أدخل نتائج الاختبار المطلوبة لتحديد نوع فقر الدم الذي تعاني منه بدقة.

source: Home
ar: الصفحه الرئيسيه

source: History
ar: السجل الشخصي

source: MyAccount
ar: صفحه الشخصيه

# success
source: Done Successfully
ar: تم بنجاح

source: Helpful Information
ar: معلومات قد تفيدك

# helpfulInformationTitle
source: Provides concise information about anemia, including its causes, symptoms, and treatments
ar: يقدم معلومات موجزة عن فقر الدم، بما في ذلك أسبابه وأعراضه وعلاجاته

# buildInfoContainerTitle1
source: Iron deficiency anemia
ar: فقر الدم بسبب نقص الحديد

# buildInfoContainerTitle2
source: Caribbean anemia (Thalassemia)
ar: الأنيميا البحر الكاريبي (الثلاسيميا)

# buildInfoContainerTitle3
source: Vitamin B12 deficiency anemia
ar: فقر الدم الناجم عن نقص فيتامين ب12

# buildInfoContainerTitle4
source: Folic acid deficiency anemia
ar: فقر الدم الناجم عن نقص حمض الفوليك

# buildInfoContainerTitle5
source: Cytocellular anemia (sickle cell anemia)
ar: لأنيميا السيكل الخلوية (فقر الدم المنجلي)

# buildInfoContainerTitle6
source: Anemia of rheumatoid arthritis
ar: فقر الدم بالتهاب المفاصل الروماتويدي

# buildInfoContainerDescription1
source: There is a deficiency of iron in the body, which affects the production of hemoglobin
ar: هناك نقص في الحديد في الجسم، مما يؤثر على إنتاج الهيموغلوبين

# buildInfoContainerDescription2
source: A group of disorders that require the body to produce hemoglobin properly. Then thalassemia results in the production of incomplete or abnormal red blood cells, leading to anemia
ar: مجموعة من الاضطرابات التي تتطلبها الجسم على إنتاج الهيموغلوبين بشكل صحيح. ثم الثلاسيميا في إنتاج خلايا دم حمراء غير مكتملة أو غير طبيعية

# buildInfoContainerDescription3
source: There is a deficiency of vitamin B12 in the body, which affects the red blood cells.
ar: نقص في فيتامين ب12 في الجسم، مما يؤثر على الخلايا الصلبة الدم الحمراء. يمكن أن يكون السبب في ذلك هو العطل الناتج عن فيتامين ب12 في الجهاز الهضمي

# buildInfoContainerDescription4
source: There is a deficiency of folic acid in the body, which affects the red blood cells
ar: نقص في حمض الفوليك في الجسم، مما يؤثر على الخلايا الصلبة بالدم الحمراء. يحتوي على فوليك أساسي أساسيًا لتكوين المعرفة ونمو الخلايا

# buildInfoContainerDescription5
source: An effect that affects the hemoglobin in red cells, causing them to form in the form of “flakes” and finally natural rings.
ar: مؤثرة تؤثر على الهيمو غلوبين في الخلايا الحمراء، مما يجعلها تتشكل على شكل 'فلزق' وأخيراً من الحلقات الطبيعية

# buildInfoContainerDescription6
source: Anemia may occur as a result of chronic rheumatoid arthritis,
ar: نتيجة لالتهاب المفاصل الرثوي المزمن، حيث يمكن أن يؤثر التهاب المفاصل العصبي على إنتاج الخلايا الجذعية أو يحفز الدم نتيجة للتقرحات أو التحفيز

source: Read Article
ar: اقرأ مقال

source: Watch video
ar: شاهد فيديو

source: Read More
ar: اقرأ اكثر

# content1
source: Iron deficiency anemia is a condition in which there is a deficiency in iron levels in the body, leading to a deficiency in the production of red blood cells and hemoglobin. Its causes are common, such as a lack of iron in the diet and blood loss due to continuous bleeding or heavy menstruation. Symptoms include shortness of breath, fatigue, loss of appetite and headache. Prevention methods include eating iron-rich foods such as meat and spinach, taking vitamin C to increase iron absorption, and staying away from foods and drinks that hinder iron absorption. You should visit a doctor if symptoms persist to properly diagnose and treat the condition.
ar: فقر الدم نقص الحديد (Iron Deficiency Anemia) هو حالة يحدث فيها نقص في مستويات الحديد في الجسم، مما يؤدي إلى نقص في إنتاج خلايا الدم الحمراء والهيموغلوبين. تعتبر أسبابه شائعة مثل نقص الحديد في النظام الغذائي وفقدان الدم بسبب النزف المستمر أو الدورة الشهرية الشديدة. من أعراضه ضيق التنفس، التعب، فقدان الشهية والصداع. تشمل طرق الوقاية تناول الأطعمة الغنية بالحديد مثل اللحوم والسبانخ، وتناول الفيتامين C لزيادة امتصاص الحديد، والابتعاد عن الأطعمة والمشروبات التي تعيق امتصاص الحديد. يجب زيارة الطبيب إذا كانت الأعراض مستمرة لتشخيص وعلاج الحالة بشكل صحيح.

# content3
source: Vitamin B12 Deficiency Anemia is a condition that occurs as a result of a deficiency of Vitamin B12 in the body, which leads to low levels of red blood cells and may cause symptoms such as fatigue, shortness of breath, and paleness. Causes include lack of intake of foods rich in Vitamin B12 or Problems with digestive absorption. Common symptoms include fatigue, dizziness, headache, and lethargy, and they can be prevented by eating foods rich in vitamin B12, such as meat, fish, and eggs. It is recommended to visit a doctor if symptoms of anemia caused by vitamin B12 deficiency appear to obtain an accurate diagnosis and an appropriate treatment plan.Vitamin B12 (Vitamin B12 Deficiency Anemia) is a condition that occurs as a result of a deficiency of vitamin B12 in the body, which leads to low levels of red blood cells and may cause symptoms such as fatigue, shortness of breath, and paleness. The causes include a lack of intake of foods rich in vitamin B12 or problems with digestive absorption, and symptoms include Fatigue, dizziness, headache, and lethargy are common, and can be prevented by eating foods rich in vitamin B12, such as meat, fish, and eggs. It is recommended to visit a doctor if symptoms of anemia caused by vitamin B12 deficiency appear to obtain an accurate diagnosis and an appropriate treatment plan.
ar: فقر الدم نقص فيتامين B12 (Vitamin B12 Deficiency Anemia) هو حالة تحدث نتيجة لنقص فيتامين B12 في الجسم، مما يؤدي إلى انخفاض مستويات خلايا الدم الحمراء وقد يسبب أعراض مثل التعب وضيق التنفس والشحوب، وتشمل الأسباب نقص تناول الأطعمة الغنية بفيتامين B12 أو مشاكل في الامتصاص الهضمي، وتشمل الأعراض الشائعة التعب والدوار والصداع والخمول، ويمكن الوقاية منها عن طريق تناول الأطعمة الغنية بفيتامين B12 مثل اللحوم والأسماك والبيض، ويُنصح بزيارة الطبيب إذا ظهرت أعراض فقر الدم الناجم عن نقص فيتامين B12 للحصول على تشخيص دقيق وخطة علاج مناسبة.

# content4
source: Folic Acid Deficiency Anemia is a condition that occurs as a result of a deficiency of folic acid in the body. This deficiency can occur as a result of several reasons, such as eating a diet poor in foods that contain folic acid or as a result of problems in the necessary absorption of it. Symptoms of this type of anemia include fatigue and stress, loss of appetite, vomiting, shortness of breath, and weight loss. This type of anemia may be prevented by eating foods rich in folic acid, such as green leafy vegetables and whole grains. It is also recommended to take nutritional supplements in some cases. You should consult a doctor if symptoms persist or if there is suspicion of folic acid deficiency anemia.
ar: فقر الدم نقص حمض الفوليك (Folic Acid Deficiency Anemia) هو حالة تحدث نتيجة لنقص الحمض الفوليك في الجسم، ويمكن أن يحدث هذا النقص نتيجة لعدة أسباب مثل تناول النظام الغذائي الفقير بالأطعمة التي تحتوي على الفوليك أو نتيجة لمشاكل في الامتصاص الضرورية له. من أعراض هذا النوع من فقر الدم تشمل التعب والإجهاد، فقدان الشهية، التقيؤ، ضيق التنفس، وفقدان الوزن، وقد يكون من الوقاية من هذا النوع من فقر الدم تناول الأطعمة الغنية بحمض الفوليك مثل الخضروات الورقية الخضراء والحبوب الكاملة، كما يُنصح بتناول المكملات الغذائية في بعض الحالات. يجب مراجعة الطبيب إذا كانت الأعراض مستمرة أو إذا كان هناك شك في وجود فقر الدم نقص حمض الفوليك.

# content2
source: Caribbean anemia (thalassemia) is a genetic disorder caused by a deficiency in the production of hemoglobin, and is caused by genetic mutations in the genes responsible for the production of hemoglobin. Hemoglobin deficiency is responsible for anemia and its multiple health effects such as fatigue, shortness of breath, and anemia. The main causes of this type of anemia include inherited genes responsible for hemoglobin, and symptoms may appear at different stages of life, including childhood. Medical care should be sought if symptoms such as extreme fatigue, dizziness, or difficulty breathing appear, as the condition may require special treatment such as genetic testing, drug therapy, or even blood transfusions in severe cases. Thalassemia is treated comprehensively through genetic guidance, active healthcare and appropriate treatment to improve the quality of life and reduce possible complications.
ar: الأنيميا البحر الكاريبي (الثلاسيميا) هي اضطراب وراثي ناجم عن نقص في إنتاج الهيموغلوبين، وتتسبب فيه الطفرات الوراثية في الجينات المسؤولة عن إنتاج الهيموغلوبين. يُعتبر نقص الهيموغلوبين مسؤولاً عن فقر الدم وتأثيراته الصحية المتعددة مثل التعب وضيق التنفس وفقر الدم. تشمل الأسباب الرئيسية لهذا النوع من الأنيميا تورث الجينات المسؤولة عن الهيموغلوبين، وقد تظهر الأعراض في مراحل مختلفة من الحياة، بما في ذلك فترة الطفولة. ينبغي البحث عن الرعاية الطبية إذا ظهرت أعراض مثل التعب الشديد أو الدوخة أو صعوبة في التنفس، حيث يمكن أن تتطلب الحالة علاجًا خاصًا مثل التحاليل الجينية والعلاج الدوائي أو حتى عمليات نقل الدم في الحالات الشديدة. يتم التعامل مع الثلاسيميا بشكل شامل من خلال التوجيه الجيني والرعاية الصحية النشطة والعلاج المناسب لتحسين جودة الحياة والحد من المضاعفات المحتملة.

# content5
source: Cytocellular anemia, commonly known as sickle cell anemia, is a genetic blood disorder characterized by abnormally shaped red blood cells. This condition is caused by a mutation in the gene responsible for producing hemoglobin, resulting in the production of sickle-shaped red blood cells instead of the normal disc-shaped ones. Symptoms of sickle cell anemia include chronic fatigue, pain episodes known as crises, increased risk of infections, delayed growth, and vision problems. Prevention strategies include genetic counseling, newborn screening, and early detection and management of complications. It's crucial to seek medical attention promptly for proper diagnosis, treatment, and ongoing management of sickle cell anemia to improve quality of life and reduce the risk of complications.
ar: فقر الدم الخلوي، المعروف باسم فقر الدم المنجلي، هو اضطراب دم وراثي يتميز بوجود خلايا دم حمراء ذات شكل غير طبيعي. تنجم هذه الحالة عن طفرة في الجين المسؤول عن إنتاج الهيموجلوبين، مما يؤدي إلى إنتاج خلايا الدم الحمراء على شكل منجل بدلا من الخلايا الطبيعية على شكل قرص. تشمل أعراض فقر الدم المنجلي التعب المزمن، ونوبات الألم المعروفة بالأزمات، وزيادة خطر الإصابة بالعدوى، وتأخر النمو، ومشاكل في الرؤية. وتشمل استراتيجيات الوقاية الاستشارة الوراثية، وفحص حديثي الولادة، والكشف المبكر عن المضاعفات وإدارتها. من الضروري التماس العناية الطبية على الفور للتشخيص المناسب والعلاج والإدارة المستمرة لفقر الدم المنجلي لتحسين نوعية الحياة وتقليل خطر حدوث مضاعفات.

# content6
source: Rheumatoid arthritis anemia is a condition that occurs as a result of rheumatoid myelitis, and causes a decrease in the number of red blood cells and/or a deficiency in the body due to the precise damage of inflammation to the bone marrow and blood production, and they may come to an agreement due to the use of certain medications such as proton pump inhibitors. Symptoms of the disease include fatigue, shortness of breath, dizziness, and headaches, and requires treatment with iron supplements and vitamins and periodic examination of hemoglobin levels, which is why a doctor sees symptoms of rheumatoid arthritis pain.
ar: فقر الدم بالتهاب المفاصل الروماتويدي هو حالة تحدث نتيجة للتهاب المفاصل الروماتويدي، ويتسبب في نقص في عدد خلايا الدم الحمراء و/أو نقص في وظيفتها بسبب التأثير المباشر للالتهاب على نخاع العظم وإنتاج الدم، وقد يتفاقم بسبب استخدام بعض الأدوية مثل مثبطات مضخة البروتون. تظهر الأعراض بما في ذلك الإرهاق والضيق التنفس والدوخة والصداع، ويتطلب العلاج تناول مكملات الحديد والفيتامينات وفحص دوري لمستويات الهيموجلوبين، وينبغي استشارة الطبيب في حالة ظهور أعراض الفقر المفاصل الروماتويدي.

source: Watch a general video
ar: شاهد فيديو عام

source: Help yourself
ar: ساعد نفسك

source: Edit Profile
ar: تعديل الملف الشخصي

source: GO back home
ar: رجوع للصفحة الرئيسية

source: The type of anemia you have is
ar: نوع الانيميا الموجودة لديك هى :

source: Result
ar: النتيجة

# testResultHistory
source: Test Results History
ar: 'سجل نتائج الاختبار

source: My data
ar: بياناتى

source: Log out
ar: خروج

source: Profile
ar: الملف الشخصي

# enterTheResult
source: 'Enter the results of a CBC test on the screen to determine the type of anemia.',
ar: 'أدخل نتيجة فحص CBC على الشاشة لتحديد نوع فقر الدم.',

source: Medicine Reminder
ar: تذكير الدواء

# noMedicine
source: No Medicine Added yet
ar: لا توجد ادوية مضافة
